<a href="https://colab.research.google.com/github/priteshkakani/DataSciencePractice/blob/main/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

## Series

In [ ]:
## Creating empty series
d=pd.Series()

In [ ]:
d

Series([], dtype: object)

In [ ]:
print(type(d))

<class 'pandas.core.series.Series'>

In [ ]:
## Creating series with one element
d=pd.Series(17)

In [ ]:
d

0    17
dtype: int64

In [ ]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [ ]:
d

0    10
1    11
2    12
dtype: int64

In [ ]:
##  creating series using list
d=pd.Series([45,78,56,445,78])

In [ ]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [ ]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [ ]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [ ]:
s2 = pd.Series(arr2)

ValueError: Data must be 1-dimensional, got ndarray of shape (3, 2) instead

In [ ]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [ ]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [ ]:
d.values()

dict_values([1, 2, 3, 4])

In [ ]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [ ]:
d.items()

dict_items([('a', 1), ('b', 2), ('c', 3), ('d', 4)])

In [ ]:
d['a']

1

In [ ]:
b=pd.Series(d)

In [ ]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
b[0]

1

In [ ]:
b['a']

1

In [ ]:
import numpy as np

In [ ]:
s1=pd.Series(arr_2)
s1

NameError: name 'arr_2' is not defined

In [ ]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [ ]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [ ]:
d[[4,5,3,6]] ## multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [ ]:
d[4]=34  ## changing the element

In [ ]:
d[[4,5,3,6]]

4    34
5    98
3     5
6     7
dtype: int64

In [ ]:
d[6:10]=[100,200,300,400]

In [ ]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [ ]:
# import numpy as np
# import pandas as pd

In [ ]:
arr3=np.array([1,2,4,6])
s=pd.Series(arr3,index=['one','Two','Three','Four'])
s

one      1
Two      2
Three    4
Four     6
dtype: int32

In [ ]:
arr4=np.array([1,2,4,6])
s1=pd.Series(arr4)
s1

0    1
1    2
2    4
3    6
dtype: int32

In [ ]:
print(s)

one      1
Two      2
Three    4
Four     6
dtype: int32

## DataFrame

In [ ]:
import pandas as pd
## empty dataframe
d=pd.DataFrame()

In [ ]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [ ]:
d

Empty DataFrame
Columns: []
Index: []

In [ ]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
#import pandas as pd

In [ ]:
data=[['abc',1],['def',2],['ghi',3],['','hij'],['klm','a']]

In [ ]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['', 'hij'], ['klm', 'a']]

In [ ]:
d1=pd.DataFrame(data)

In [ ]:
d1

     0    1
0  abc    1
1  def    2
2  ghi    3
3       hij
4  klm    a

In [ ]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## chnaging the column

In [ ]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [ ]:
d

     A    B
A  abc    1
B  def    2
C  ghi    3
D       hij
E  klm    a

In [ ]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [ ]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [ ]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=True)

In [ ]:
d

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [ ]:
d.rename({'Candidate':'Candidate112','Age_years':'Age_years112'},axis=1,inplace=True)

In [ ]:
d

  Candidate112  Age_years112
0            a            45
1            b            12
2            c            48
3            d            25
4            e            12
5            f            56

In [ ]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [ ]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [ ]:
data[2][0]

'Kelly'

In [ ]:
data[2][0]='asdf'

In [ ]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['asdf', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [ ]:
import pandas as pd

In [ ]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [ ]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
d[1,1]

KeyError: (1, 1)

In [ ]:
d.Name

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [ ]:
## accessing one single column
d['Name']

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [ ]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2   asdf      Eco
3  Boris      Geo
4    Ken  English

In [ ]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
d.iloc[1,1]

12

In [ ]:
#d[0,0]

In [ ]:
d.iloc[0,0] ="ALEX"  # changing an element

In [ ]:
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
d['Gender'] = "Male"  # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALEX   10    Maths   Male
1    Bob   12  Science   Male
2   asdf   15      Eco   Male
3  Boris   14      Geo   Male
4    Ken   18  English   Male

In [ ]:
d['Age'] = d['Age'] - 1   # d['Age']-=1
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [ ]:
d.iloc[:,[0,1]] # Index location

    Name  Age
0   ALEX    9
1    Bob   11
2   asdf   14
3  Boris   13
4    Ken   17

In [ ]:
d.iloc[[3,1],[0,1]]  # [row,col]

    Name  Age
3  Boris   13
1    Bob   11

In [ ]:
d.iloc[1:3,[0,1]]

   Name  Age
1   Bob   11
2  asdf   14

In [ ]:
d.iloc[1]  # access row 1

Name           Bob
Age             11
Subject    Science
Gender        Male
Name: 1, dtype: object

In [ ]:
pwd

In [ ]:
d

In [ ]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

loc used for locating with column names

In [ ]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

In [ ]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz']

In [ ]:
d

In [ ]:
d.loc[:,1]

In [ ]:
# loc is typically used for accessing columns.

In [ ]:
d['Age']

In [ ]:
d.loc[:,'Age']

In [ ]:
d

In [ ]:
d.loc[3] ## getting the rows with singular index value

In [ ]:
d.iloc[:,[1,2]]

In [ ]:
d.iloc[:3,1:3]

In [ ]:
pwd